``
2023/03/16 11:08:08[TERRAFORM_CONSOLE] [INFO] Getting providers from hashicorp registry and/or custom terraform providers
2023/03/16 11:08:15[TERRAFORM_CONSOLE] [INFO] Initializing modules...
2023/03/16 11:08:15[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:15[TERRAFORM_CONSOLE] [INFO] Initializing provider plugins...
2023/03/16 11:08:15[TERRAFORM_CONSOLE] [INFO] - Finding hashicorp/oci versions matching ">= 4.0.0"...
2023/03/16 11:08:15[TERRAFORM_CONSOLE] [INFO] - Finding latest version of hashicorp/template...
2023/03/16 11:08:15[TERRAFORM_CONSOLE] [INFO] - Finding oracle/oci versions matching ">= 4.67.3"...
2023/03/16 11:08:15[TERRAFORM_CONSOLE] [INFO] - Installing hashicorp/template v2.2.0...
2023/03/16 11:08:16[TERRAFORM_CONSOLE] [INFO] - Installed hashicorp/template v2.2.0 (signed by HashiCorp)
2023/03/16 11:08:17[TERRAFORM_CONSOLE] [INFO] - Installing oracle/oci v4.112.0...
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] - Installed oracle/oci v4.112.0 (signed by a HashiCorp partner, key ID 1533A49284137CEB)
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] - Installing hashicorp/oci v4.112.0...
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] - Installed hashicorp/oci v4.112.0 (unauthenticated)
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] Partner and community providers are signed by their developers.
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] If you'd like to know more about provider signing, you can read about it here:
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] https://www.terraform.io/docs/cli/plugins/signing.html
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] Terraform has created a lock file .terraform.lock.hcl to record the provider
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] selections it made above. Include this file in your version control repository
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] so that Terraform can guarantee to make the same selections by default when
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] you run "terraform init" in the future.
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] Terraform has been successfully initialized!
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] You may now begin working with Terraform. Try running "terraform plan" to see
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] any changes that are required for your infrastructure. All Terraform commands
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] should now work.
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] If you ever set or change modules or backend configuration for Terraform,
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] rerun this command to reinitialize your working directory. If you forget, other
2023/03/16 11:08:20[TERRAFORM_CONSOLE] [INFO] commands will detect it and remind you to do so if necessary.
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] Terraform used the selected providers to generate the following execution
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] plan. Resource actions are indicated with the following symbols:
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   + create
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]  <= read (data resources)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] Terraform will perform the following actions:
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # oci_core_network_security_group.nsg will be created
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   + resource "oci_core_network_security_group" "nsg" {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + compartment_id = "ocid1.tenancy.oc1..aaaaaaaazdnmstgymuhtokjwo5wieqj5kza3svfgg6lwnxm2tz6u4ccci5pa"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + defined_tags   = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + display_name   = "vsc-nsg"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + freeform_tags  = {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "app"         = "code-server"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "github"      = "https://github.com/oracle-devrel/terraform-oci-code-server"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "oci"         = "ODE"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "terraformed" = "Please do not edit manually"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + id             = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + state          = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + time_created   = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + vcn_id         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]     }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # oci_core_subnet.sub will be created
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   + resource "oci_core_subnet" "sub" {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + availability_domain        = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + cidr_block                 = "172.16.0.0/30"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + compartment_id             = "ocid1.tenancy.oc1..aaaaaaaazdnmstgymuhtokjwo5wieqj5kza3svfgg6lwnxm2tz6u4ccci5pa"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + defined_tags               = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + dhcp_options_id            = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + display_name               = "vsc-sub"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + dns_label                  = "vscsub"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + freeform_tags              = {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "app"         = "code-server"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "github"      = "https://github.com/oracle-devrel/terraform-oci-code-server"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "oci"         = "ODE"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "terraformed" = "Please do not edit manually"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + id                         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + ipv6cidr_block             = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + ipv6cidr_blocks            = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + ipv6virtual_router_ip      = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + prohibit_internet_ingress  = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + prohibit_public_ip_on_vnic = false
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + route_table_id             = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + security_list_ids          = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + state                      = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + subnet_domain_name         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + time_created               = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + vcn_id                     = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + virtual_router_ip          = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + virtual_router_mac         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]     }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # module.oci_security_policies.data.oci_core_network_security_groups.this will be read during apply
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # (config refers to values not yet known)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]  <= data "oci_core_network_security_groups" "this"  {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + compartment_id          = "ocid1.tenancy.oc1..aaaaaaaazdnmstgymuhtokjwo5wieqj5kza3svfgg6lwnxm2tz6u4ccci5pa"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + id                      = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + network_security_groups = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + vcn_id                  = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]     }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # module.oci_security_policies.oci_core_network_security_group_security_rule.ingress_rules_tcp_no_src_dst[0] will be created
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   + resource "oci_core_network_security_group_security_rule" "ingress_rules_tcp_no_src_dst" {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + description               = "code-server"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + destination               = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + destination_type          = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + direction                 = "INGRESS"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + id                        = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + is_valid                  = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + network_security_group_id = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + protocol                  = "6"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + source                    = "0.0.0.0/0"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + source_type               = "CIDR_BLOCK"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + stateless                 = false
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + time_created              = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + tcp_options {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + destination_port_range {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + max = 80
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + min = 80
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]             }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]     }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # module.vcn.oci_core_default_security_list.restore_default[0] will be created
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   + resource "oci_core_default_security_list" "restore_default" {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + compartment_id             = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + defined_tags               = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + display_name               = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + freeform_tags              = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + id                         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + manage_default_resource_id = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + state                      = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + time_created               = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + egress_security_rules {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + description      = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + destination      = "0.0.0.0/0"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + destination_type = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + protocol         = "all"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + stateless        = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + ingress_security_rules {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + description = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + protocol    = "1"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + source      = "172.16.0.0/28"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + source_type = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + stateless   = false
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + icmp_options {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + code = -1
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + type = 3
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]             }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + ingress_security_rules {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + description = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + protocol    = "1"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + source      = "0.0.0.0/0"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + source_type = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + stateless   = false
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + icmp_options {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + code = 4
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + type = 3
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]             }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + ingress_security_rules {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + description = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + protocol    = "6"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + source      = "0.0.0.0/0"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + source_type = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + stateless   = false
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + tcp_options {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + max = 22
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + min = 22
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]             }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]     }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # module.vcn.oci_core_internet_gateway.ig[0] will be created
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   + resource "oci_core_internet_gateway" "ig" {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + compartment_id = "ocid1.tenancy.oc1..aaaaaaaazdnmstgymuhtokjwo5wieqj5kza3svfgg6lwnxm2tz6u4ccci5pa"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + defined_tags   = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + display_name   = "internet-gateway"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + enabled        = true
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + freeform_tags  = {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "module"      = "oracle-terraform-modules/vcn/oci"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "terraformed" = "Please do not edit manually"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + id             = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + route_table_id = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + state          = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + time_created   = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + vcn_id         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]     }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # module.vcn.oci_core_route_table.ig[0] will be created
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   + resource "oci_core_route_table" "ig" {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + compartment_id = "ocid1.tenancy.oc1..aaaaaaaazdnmstgymuhtokjwo5wieqj5kza3svfgg6lwnxm2tz6u4ccci5pa"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + defined_tags   = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + display_name   = "internet-route"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + freeform_tags  = {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "module"      = "oracle-terraform-modules/vcn/oci"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "terraformed" = "Please do not edit manually"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + id             = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + state          = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + time_created   = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + vcn_id         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + route_rules {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + cidr_block        = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + description       = "Terraformed - Auto-generated at Internet Gateway creation: Internet Gateway as default gateway"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + destination       = "0.0.0.0/0"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + destination_type  = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + network_entity_id = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + route_type        = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]     }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # module.vcn.oci_core_vcn.vcn will be created
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   + resource "oci_core_vcn" "vcn" {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + byoipv6cidr_blocks               = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + cidr_block                       = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + cidr_blocks                      = [
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "172.16.0.0/28",
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         ]
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + compartment_id                   = "ocid1.tenancy.oc1..aaaaaaaazdnmstgymuhtokjwo5wieqj5kza3svfgg6lwnxm2tz6u4ccci5pa"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + default_dhcp_options_id          = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + default_route_table_id           = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + default_security_list_id         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + defined_tags                     = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + display_name                     = "vsc-network"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + dns_label                        = "vcnmodule"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + freeform_tags                    = {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "module"      = "oracle-terraform-modules/vcn/oci"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "terraformed" = "Please do not edit manually"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + id                               = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + ipv6cidr_blocks                  = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + ipv6private_cidr_blocks          = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + is_ipv6enabled                   = false
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + is_oracle_gua_allocation_enabled = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + state                            = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + time_created                     = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + vcn_domain_name                  = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + byoipv6cidr_details {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + byoipv6range_id = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + ipv6cidr_block  = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]     }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # module.vsc_instance.data.oci_core_private_ips.private_ips[0] will be read during apply
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # (config refers to values not yet known)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]  <= data "oci_core_private_ips" "private_ips"  {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + id          = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + private_ips = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + vnic_id     = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]     }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # module.vsc_instance.data.oci_core_subnet.instance_subnet[0] will be read during apply
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # (config refers to values not yet known)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]  <= data "oci_core_subnet" "instance_subnet"  {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + availability_domain        = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + cidr_block                 = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + compartment_id             = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + defined_tags               = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + dhcp_options_id            = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + display_name               = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + dns_label                  = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + freeform_tags              = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + id                         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + ipv6cidr_block             = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + ipv6cidr_blocks            = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + ipv6virtual_router_ip      = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + prohibit_internet_ingress  = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + prohibit_public_ip_on_vnic = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + route_table_id             = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + security_list_ids          = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + state                      = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + subnet_domain_name         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + subnet_id                  = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + time_created               = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + vcn_id                     = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + virtual_router_ip          = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + virtual_router_mac         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]     }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # module.vsc_instance.data.oci_core_vnic_attachments.vnic_attachment[0] will be read during apply
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # (config refers to values not yet known)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]  <= data "oci_core_vnic_attachments" "vnic_attachment"  {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + compartment_id   = "ocid1.tenancy.oc1..aaaaaaaazdnmstgymuhtokjwo5wieqj5kza3svfgg6lwnxm2tz6u4ccci5pa"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + id               = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + instance_id      = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + vnic_attachments = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]     }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # module.vsc_instance.oci_core_instance.instance[0] will be created
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   + resource "oci_core_instance" "instance" {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + availability_domain                 = "ofoK:AP-SINGAPORE-1-AD-1"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + boot_volume_id                      = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + capacity_reservation_id             = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + compartment_id                      = "ocid1.tenancy.oc1..aaaaaaaazdnmstgymuhtokjwo5wieqj5kza3svfgg6lwnxm2tz6u4ccci5pa"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + dedicated_vm_host_id                = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + defined_tags                        = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + display_name                        = "oci-code-server"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + fault_domain                        = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + freeform_tags                       = {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "app"         = "code-server"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "github"      = "https://github.com/oracle-devrel/terraform-oci-code-server"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "module"      = "oracle-terraform-modules/compute-instance/oci"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "oci"         = "ODE"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "terraformed" = "Please do not edit manually"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + hostname_label                      = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + id                                  = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + image                               = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + ipxe_script                         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + is_pv_encryption_in_transit_enabled = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + launch_mode                         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + metadata                            = {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "ssh_authorized_keys" = ""
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "user_data"           = "I2Nsb3VkLWNvbmZpZwpydW5jbWQ6CiAtIGlwdGFibGVzIC1JIElOUFVUIDYgLW0gc3RhdGUgLS1zdGF0ZSBORVcgLXAgdGNwIC0tZHBvcnQgODAgLWogQUNDRVBUCiAtIG5ldGZpbHRlci1wZXJzaXN0ZW50IHNhdmUKIC0gd2hpbGUgZnVzZXIgL3Zhci9saWIvZHBrZy9sb2NrID4vZGV2L251bGwgMj4mMSA7IGRvIHNsZWVwIDUwOyBkb25lOwogLSB3Z2V0IGh0dHBzOi8vcmF3LmdpdGh1YnVzZXJjb250ZW50LmNvbS9jb2Rlci9kZXBsb3ktY29kZS1zZXJ2ZXIvbWFpbi9kZXBsb3ktdm0vbGF1bmNoLWNvZGUtc2VydmVyLnNoIC1PIC0gfCBzaAo="
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + preserve_boot_volume                = false
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + private_ip                          = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + public_ip                           = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + region                              = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + shape                               = "VM.Standard.E2.1.Micro"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + state                               = "RUNNING"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + subnet_id                           = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + system_tags                         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + time_created                        = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + time_maintenance_reboot_due         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + agent_config {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + are_all_plugins_disabled = false
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + is_management_disabled   = false
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + is_monitoring_disabled   = false
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + plugins_config {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + desired_state = "ENABLED"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + name          = "Oracle Autonomous Linux"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]             }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + plugins_config {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + desired_state = "ENABLED"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + name          = "Bastion"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]             }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + plugins_config {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + desired_state = "DISABLED"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + name          = "Block Volume Management"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]             }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + plugins_config {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + desired_state = "ENABLED"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + name          = "Custom Logs Monitoring"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]             }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + plugins_config {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + desired_state = "DISABLED"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + name          = "Management Agent"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]             }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + plugins_config {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + desired_state = "ENABLED"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + name          = "Compute Instance Monitoring"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]             }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + plugins_config {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + desired_state = "ENABLED"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + name          = "OS Management Service Agent"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]             }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + plugins_config {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + desired_state = "ENABLED"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + name          = "Compute Instance Run Command"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]             }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + plugins_config {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + desired_state = "ENABLED"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + name          = "Vulnerability Scanning"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]             }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + plugins_config {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + desired_state = "DISABLED"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + name          = "Oracle Java Management Service"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]             }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + availability_config {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + is_live_migration_preferred = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + recovery_action             = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + create_vnic_details {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + assign_public_ip       = "false"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + defined_tags           = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + display_name           = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + freeform_tags          = {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + "app"         = "code-server"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + "github"      = "https://github.com/oracle-devrel/terraform-oci-code-server"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + "module"      = "oracle-terraform-modules/compute-instance/oci"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + "oci"         = "ODE"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + "terraformed" = "Please do not edit manually"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]             }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + nsg_ids                = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + private_ip             = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + skip_source_dest_check = false
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + subnet_id              = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + vlan_id                = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + instance_options {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + are_legacy_imds_endpoints_disabled = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + launch_options {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + boot_volume_type                    = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + firmware                            = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + is_consistent_volume_naming_enabled = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + is_pv_encryption_in_transit_enabled = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + network_type                        = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + remote_data_volume_type             = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + platform_config {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + are_virtual_instructions_enabled               = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + is_access_control_service_enabled              = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + is_input_output_memory_management_unit_enabled = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + is_measured_boot_enabled                       = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + is_memory_encryption_enabled                   = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + is_secure_boot_enabled                         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + is_symmetric_multi_threading_enabled           = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + is_trusted_platform_module_enabled             = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + numa_nodes_per_socket                          = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + percentage_of_cores_enabled                    = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + type                                           = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + preemptible_instance_config {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + preemption_action {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + preserve_boot_volume = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]               + type                 = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]             }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + shape_config {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + baseline_ocpu_utilization     = "BASELINE_1_1"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + gpu_description               = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + gpus                          = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + local_disk_description        = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + local_disks                   = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + local_disks_total_size_in_gbs = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + max_vnic_attachments          = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + memory_in_gbs                 = 1
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + networking_bandwidth_in_gbps  = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + nvmes                         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + ocpus                         = 1
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + processor_description         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + source_details {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + boot_volume_size_in_gbs = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + boot_volume_vpus_per_gb = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + source_id               = "ocid1.image.oc1.ap-singapore-1.aaaaaaaa2wjhkdqddox4gsqreruwafou52hupyo3d2gcqk4ihdsyy6lyawwq"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + source_type             = "image"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + timeouts {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + create = "25m"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]     }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # module.vsc_instance.oci_core_public_ip.public_ip[0] will be created
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   + resource "oci_core_public_ip" "public_ip" {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + assigned_entity_id   = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + assigned_entity_type = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + availability_domain  = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + compartment_id       = "ocid1.tenancy.oc1..aaaaaaaazdnmstgymuhtokjwo5wieqj5kza3svfgg6lwnxm2tz6u4ccci5pa"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + defined_tags         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + display_name         = "oci-code-server"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + freeform_tags        = {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "app"         = "code-server"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "github"      = "https://github.com/oracle-devrel/terraform-oci-code-server"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "module"      = "oracle-terraform-modules/compute-instance/oci"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "oci"         = "ODE"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "terraformed" = "Please do not edit manually"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + id                   = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + ip_address           = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + lifetime             = "EPHEMERAL"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + private_ip_id        = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + public_ip_pool_id    = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + scope                = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + state                = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + time_created         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]     }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # module.vsc_instance.oci_core_volume.volume[0] will be created
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   + resource "oci_core_volume" "volume" {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + auto_tuned_vpus_per_gb = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + availability_domain    = "ofoK:AP-SINGAPORE-1-AD-1"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + backup_policy_id       = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + compartment_id         = "ocid1.tenancy.oc1..aaaaaaaazdnmstgymuhtokjwo5wieqj5kza3svfgg6lwnxm2tz6u4ccci5pa"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + defined_tags           = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + display_name           = "oci-code-server_volume0"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + freeform_tags          = {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "app"         = "code-server"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "github"      = "https://github.com/oracle-devrel/terraform-oci-code-server"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "module"      = "oracle-terraform-modules/compute-instance/oci"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "oci"         = "ODE"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + "terraformed" = "Please do not edit manually"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + id                     = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + is_auto_tune_enabled   = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + is_hydrated            = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + kms_key_id             = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + size_in_gbs            = "50"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + size_in_mbs            = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + state                  = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + system_tags            = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + time_created           = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + volume_backup_id       = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + volume_group_id        = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + vpus_per_gb            = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + autotune_policies {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + autotune_type   = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + max_vpus_per_gb = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + block_volume_replicas {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + availability_domain     = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + block_volume_replica_id = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + display_name            = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + source_details {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + id   = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]           + type = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]         }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]     }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   # module.vsc_instance.oci_core_volume_attachment.volume_attachment[0] will be created
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   + resource "oci_core_volume_attachment" "volume_attachment" {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + attachment_type                     = "paravirtualized"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + availability_domain                 = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + chap_secret                         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + chap_username                       = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + compartment_id                      = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + device                              = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + display_name                        = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + encryption_in_transit_type          = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + id                                  = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + instance_id                         = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + ipv4                                = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + iqn                                 = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + is_agent_auto_iscsi_login_enabled   = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + is_multipath                        = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + is_pv_encryption_in_transit_enabled = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + is_read_only                        = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + is_shareable                        = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + iscsi_login_state                   = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + multipath_devices                   = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + port                                = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + state                               = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + time_created                        = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + use_chap                            = false
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + volume_id                           = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]     }
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] Plan: 11 to add, 0 to change, 0 to destroy.
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO] Changes to Outputs:
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   + code-server-publicIP = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]   + vsc_instance         = {
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + Instance name = "oci-code-server"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + OS version    = "Canonical-Ubuntu-20.04-2023.02.15-0"
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]       + Public IP     = (known after apply)
2023/03/16 11:08:26[TERRAFORM_CONSOLE] [INFO]     }
2023/03/16 11:08:27[TERRAFORM_CONSOLE] [INFO] module.vcn.oci_core_vcn.vcn: Creating...
2023/03/16 11:08:28[TERRAFORM_CONSOLE] [INFO] module.vcn.oci_core_vcn.vcn: Creation complete after 1s [id=ocid1.vcn.oc1.ap-singapore-1.amaaaaaamirlsjaal3drjhz5krwpk54chezdx5au573lyvcomft5dlnmjvkq]
2023/03/16 11:08:28[TERRAFORM_CONSOLE] [INFO] module.vcn.oci_core_internet_gateway.ig[0]: Creating...
2023/03/16 11:08:28[TERRAFORM_CONSOLE] [INFO] module.oci_security_policies.data.oci_core_network_security_groups.this: Reading...
2023/03/16 11:08:28[TERRAFORM_CONSOLE] [INFO] oci_core_network_security_group.nsg: Creating...
2023/03/16 11:08:28[TERRAFORM_CONSOLE] [INFO] module.vcn.oci_core_default_security_list.restore_default[0]: Creating...
2023/03/16 11:08:28[TERRAFORM_CONSOLE] [INFO] module.oci_security_policies.data.oci_core_network_security_groups.this: Read complete after 0s [id=CoreNetworkSecurityGroupsDataSource-564642159]
2023/03/16 11:08:28[TERRAFORM_CONSOLE] [INFO] module.vcn.oci_core_default_security_list.restore_default[0]: Creation complete after 0s [id=ocid1.securitylist.oc1.ap-singapore-1.aaaaaaaaqmpr25hqej35fz3uaq5ebeqqbefkbjk5zqyxcks25t6ju35oxoxa]
2023/03/16 11:08:29[TERRAFORM_CONSOLE] [INFO] oci_core_network_security_group.nsg: Creation complete after 0s [id=ocid1.networksecuritygroup.oc1.ap-singapore-1.aaaaaaaazqirzs6qbzf5p6bbqrlyffhfwgpigc5v76ezzyc5br5jsfa636jq]
2023/03/16 11:08:29[TERRAFORM_CONSOLE] [INFO] module.oci_security_policies.oci_core_network_security_group_security_rule.ingress_rules_tcp_no_src_dst[0]: Creating...
2023/03/16 11:08:29[TERRAFORM_CONSOLE] [INFO] module.vcn.oci_core_internet_gateway.ig[0]: Creation complete after 0s [id=ocid1.internetgateway.oc1.ap-singapore-1.aaaaaaaaita6kuix4jejdh6f5xy6v3ric6hjbgvgm25tgsei2iu5g5ddsipa]
2023/03/16 11:08:29[TERRAFORM_CONSOLE] [INFO] module.vcn.oci_core_route_table.ig[0]: Creating...
2023/03/16 11:08:29[TERRAFORM_CONSOLE] [INFO] module.oci_security_policies.oci_core_network_security_group_security_rule.ingress_rules_tcp_no_src_dst[0]: Creation complete after 1s [id=CC5251]
2023/03/16 11:08:30[TERRAFORM_CONSOLE] [INFO] module.vcn.oci_core_route_table.ig[0]: Creation complete after 1s [id=ocid1.routetable.oc1.ap-singapore-1.aaaaaaaave57x3wwq7tnhocwrhcsu2ztyz56tbl2sqsb2gfnrisgy7k4m6fq]
2023/03/16 11:08:30[TERRAFORM_CONSOLE] [INFO] oci_core_subnet.sub: Creating...
2023/03/16 11:08:38[TERRAFORM_CONSOLE] [INFO] oci_core_subnet.sub: Creation complete after 9s [id=ocid1.subnet.oc1.ap-singapore-1.aaaaaaaaq345drk5xxehkecenprvmtskbqshkkm7vvdh7joniisa643nlgua]
2023/03/16 11:08:38[TERRAFORM_CONSOLE] [INFO] module.vsc_instance.data.oci_core_subnet.instance_subnet[0]: Reading...
2023/03/16 11:08:38[TERRAFORM_CONSOLE] [INFO] module.vsc_instance.data.oci_core_subnet.instance_subnet[0]: Read complete after 0s [id=ocid1.subnet.oc1.ap-singapore-1.aaaaaaaaq345drk5xxehkecenprvmtskbqshkkm7vvdh7joniisa643nlgua]
2023/03/16 11:08:38[TERRAFORM_CONSOLE] [INFO] module.vsc_instance.oci_core_instance.instance[0]: Creating...
2023/03/16 11:08:40[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:40[TERRAFORM_CONSOLE] [INFO] Error: 500-InternalError, Out of host capacity.
2023/03/16 11:08:40[TERRAFORM_CONSOLE] [INFO] Suggestion: The service for this resource encountered an error. Please contact support for help with service: Core Instance
2023/03/16 11:08:40[TERRAFORM_CONSOLE] [INFO] Documentation: https://registry.terraform.io/providers/oracle/oci/latest/docs/resources/core_instance 
2023/03/16 11:08:40[TERRAFORM_CONSOLE] [INFO] API Reference: https://docs.oracle.com/iaas/api/#/en/iaas/20160918/Instance/LaunchInstance 
2023/03/16 11:08:40[TERRAFORM_CONSOLE] [INFO] Request Target: POST https://iaas.ap-singapore-1.oraclecloud.com/20160918/instances 
2023/03/16 11:08:40[TERRAFORM_CONSOLE] [INFO] Provider version: 4.112.0, released on 2023-03-15.  
2023/03/16 11:08:40[TERRAFORM_CONSOLE] [INFO] Service: Core Instance 
2023/03/16 11:08:40[TERRAFORM_CONSOLE] [INFO] Operation Name: LaunchInstance 
2023/03/16 11:08:40[TERRAFORM_CONSOLE] [INFO] OPC request ID: ec5c33af055ec4aec301250b07648adf/B46E079E33046BCB056670FD6DA84389/4F6AB153AFB95E67712B22D44295FF1B 
2023/03/16 11:08:40[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:40[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:40[TERRAFORM_CONSOLE] [INFO]   with module.vsc_instance.oci_core_instance.instance[0],
2023/03/16 11:08:40[TERRAFORM_CONSOLE] [INFO]   on .terraform/modules/vsc_instance/main.tf line 60, in resource "oci_core_instance" "instance":
2023/03/16 11:08:40[TERRAFORM_CONSOLE] [INFO]   60: resource "oci_core_instance" "instance" {
2023/03/16 11:08:40[TERRAFORM_CONSOLE] [INFO] 
2023/03/16 11:08:40[TERRAFORM_CONSOLE] [INFO] 
``